MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pwr.c
Config defines       | Description        | Default value | Note
---------------------| ---------------    | ------------- | ------------------------------------------------------------
PRODUCT              | from IDE           | NA            | The selected device
USE_HAL_PWR_MODULE   | from hal_conf.h    | 1U            | When set, HAL PWR module is enabled.
USE_ASSERT_DBG_PARAM | from IDE           | None          | When defined, enable parameter assertions.
USE_HAL_CHECK_PARAM  | from hal_conf.h    | 0U            | When set, parameters are checked at runtime.
  */
/**
  * @}
  */
#if defined(PWR)
#if defined(USE_HAL_PWR_MODULE) && (USE_HAL_PWR_MODULE == 1)

/* Private typedef ---------------------------------------------------------------------------------------------------*/
/* Private defines ---------------------------------------------------------------------------------------------------*/
/** @defgroup PWR_Private_Constants PWR Private Constants
  * @{
  */
/* Number of memory retention pages */
#define PWR_SRAM1_RETENTION_PAGES_MAX 0x01UL /*!< SRAM1 maximum page count     */
#if defined(PWR_PMCR_SRAM2_1_SO)
#if defined(PWR_PMCR_SRAM2_3_SO)
#define PWR_SRAM2_RETENTION_PAGES_MAX 0x03UL /*!< SRAM2 maximum page count     */
#else
#define PWR_SRAM2_RETENTION_PAGES_MAX 0x02UL /*!< SRAM2 maximum page count     */
#endif /* defined(PWR_PMCR_SRAM2_3_SO) */
#else
#define PWR_SRAM2_RETENTION_PAGES_MAX 0x01UL /*!< SRAM2 maximum page count     */
#endif /* PWR_PMCR_SRAM2_1_SO */

/*! Number of memory banks */
#define PWR_MEMORY_BANKS_NUMBER (uint32_t)(sizeof(PWR_MemoryFullRetentionMap) / sizeof(PWR_MemoryFullRetentionMap[0]))
/**
  * @}
  */

/* Private variables -------------------------------------------------------------------------------------------------*/
/** @defgroup PWR_Private_Variables PWR Private Variables
  * @{
  */
/*! Memory retention mapping table */
static const uint32_t PWR_MemoryFullRetentionMap[] =
{
  LL_PWR_SRAM1_STOP_RETENTION,
  LL_PWR_SRAM2_STOP_RETENTION
};

/*! Memory maximum page retention mapping table */
static const uint32_t PWR_MemoryMaxPagesRetentionMap[PWR_MEMORY_BANKS_NUMBER] =
{
  PWR_SRAM1_RETENTION_PAGES_MAX,
  PWR_SRAM2_RETENTION_PAGES_MAX
};
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup PWR_Private_Macros PWR Private Macros
  * @{
  */

/*! Set wakeup pins check macro */
#define IS_PWR_SET_WAKEUP_PIN(pin) \
  ((((pin) & (HAL_PWR_WAKEUP_PIN_ALL)) != 0U) && (((pin) & (~HAL_PWR_WAKEUP_PIN_ALL)) == 0U))

/*! Set wakeup sources check macro */
#define IS_PWR_SET_WAKEUP_SOURCE(source) \
  ((((source) & (HAL_PWR_WAKEUP_SOURCE_ALL)) != 0U) && (((source) & (~HAL_PWR_WAKEUP_SOURCE_ALL)) == 0U))

/*! Wakeup pin polarity check macro */
#define IS_PWR_WAKEUP_PIN_POLARITY(polarity) \
  (((polarity) == HAL_PWR_WAKEUP_PIN_POLARITY_HIGH) || ((polarity) == HAL_PWR_WAKEUP_PIN_POLARITY_LOW))

/*! Wakeup pin pull check macro */
#define IS_PWR_WAKEUP_PIN_PULL(pull)          \
  (((pull) == HAL_PWR_WAKEUP_PIN_PULL_NO)     \
   || ((pull) == HAL_PWR_WAKEUP_PIN_PULL_UP)  \
   || ((pull) == HAL_PWR_WAKEUP_PIN_PULL_DOWN))

/*! Get wakeup pins check macro */
#if defined(PWR_WUCR_WUPEN3) && defined(PWR_WUCR_WUPEN6) && defined(PWR_WUCR_WUPEN7)
#define IS_PWR_GET_WAKEUP_PIN(pin)    \
  (((pin) == HAL_PWR_WAKEUP_PIN_1)    \
   || ((pin) == HAL_PWR_WAKEUP_PIN_2) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_3) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_4) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_5) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_6) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_7))
#else
#define IS_PWR_GET_WAKEUP_PIN(pin)    \
  (((pin) == HAL_PWR_WAKEUP_PIN_1)    \
   || ((pin) == HAL_PWR_WAKEUP_PIN_2) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_4) \
   || ((pin) == HAL_PWR_WAKEUP_PIN_5))
#endif /* PWR_WUCR_WUPEN3 && PWR_WUCR_WUPEN6 && PWR_WUCR_WUPEN7 */

/*! Low power mode entry check macro */
#define IS_PWR_LP_MODE_ENTRY(entry) \
  (((entry) == (uint32_t)HAL_PWR_LOW_PWR_MODE_WFE) || ((entry) == (uint32_t)HAL_PWR_LOW_PWR_MODE_WFI))

/*! Stop mode check macro */
#define IS_PWR_STOP_MODE(mode)                 \
  (((mode) == (uint32_t)HAL_PWR_STOP0_MODE)    \
   || (((mode) == (uint32_t)HAL_PWR_STOP1_MODE)))

/*! Core sleep mode check macro */
#define IS_PWR_CORE_SLEEP_MODE(mode) \
  (((mode) == ((uint32_t)HAL_PWR_CORE_SLEEP)) || ((mode) == ((uint32_t)HAL_PWR_CORE_DEEP_SLEEP)))

/*! Memory retention check macro */
#define IS_PWR_SINGLE_PAGE_MEMORY_RETENTION(memory) \
  ((((uint32_t)(memory)) < PWR_MEMORY_BANKS_NUMBER) && ((PWR_MemoryMaxPagesRetentionMap[memory]) == 1U))

#if defined(PWR_PMCR_SRAM2_1_SO)
/*! Memory page retention check macro */
#define IS_PWR_MEMORY_PAGES_RETENTION(memory, page_idx, page_nbr)                     \
  ((((uint32_t)(memory)) < PWR_MEMORY_BANKS_NUMBER)                                   \
   && ((((page_idx) - 1U) + (page_nbr)) <= (PWR_MemoryMaxPagesRetentionMap[memory]))  \
   && ((((PWR_MemoryMaxPagesRetentionMap[memory]) > 1U)))                             \
   && ((((page_idx) - 1U) + (page_nbr)) > 0U))
#endif /* PWR_PMCR_SRAM2_1_SO */

/*! I/O selection retention check macro */
#define IS_PWR_SET_IO_RETENTION(io)                 \
  (((io) == (uint32_t)HAL_PWR_IO_RETENTION_JTAGIO)  \
   || ((io) == (uint32_t)HAL_PWR_IO_RETENTION_GPIO) \
   || ((io) == (uint32_t)HAL_PWR_IO_RETENTION_ALL))

/*! I/O selection retention enabled check macro */
#define IS_PWR_GET_IO_RETENTION(io)                 \
  (((io) == (uint32_t)HAL_PWR_IO_RETENTION_JTAGIO)  \
   || ((io) == (uint32_t)HAL_PWR_IO_RETENTION_GPIO))

/*! PWR set privilege item check macro */
#define IS_PWR_SET_PRIV_ITEM(item)  \
  ((((item) & HAL_PWR_PRIV_ITEM_ALL) != 0U) && (((item) & (~HAL_PWR_PRIV_ITEM_ALL)) == 0U))

/*! PWR get privilege item check macro */
#define IS_PWR_GET_PRIV_ITEM(item)  \
  ((item) == HAL_PWR_PRIV_ITEM_ALL)
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup PWR_Exported_Functions HAL PWR Functions
  * @{
  */

/** @addtogroup PWR_Exported_Functions_Group1 Wakeup pins management functions
  * @{
  This section provides functions to manage the wakeup pins.
  - Call HAL_PWR_LP_SetConfigWakeupPin() to configure the wakeup pin.
  - Call HAL_PWR_LP_GetConfigWakeupPin() to get the wakeup pin configuration.
  - Call HAL_PWR_LP_EnableWakeupPin() to enable the wakeup pin.
  - Call HAL_PWR_LP_DisableWakeupPin() to disable the wakeup pin.
  - Call HAL_PWR_LP_IsEnabledWakeupPin() to check whether the wakeup pin is enabled.
  - Call HAL_PWR_LP_GetWakeupSource() to get the wakeup source(s).
  - Call HAL_PWR_LP_CleanWakeupSource() to clear wakeup source(s).
  */

/**
  * @brief  Set wakeup pin configuration.
  * @param  wakeup_pin        This parameter can be a combination of @ref PWR_wakeup_pin.
  *         @arg @ref HAL_PWR_WAKEUP_PIN_1
  *         @arg @ref HAL_PWR_WAKEUP_PIN_2
  *         @arg @ref HAL_PWR_WAKEUP_PIN_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_4
  *         @arg @ref HAL_PWR_WAKEUP_PIN_5
  *         @arg @ref HAL_PWR_WAKEUP_PIN_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_ALL
  * @param  p_config          Pointer to a @ref hal_pwr_wakeup_pin_config_t structure.
  * @retval HAL_INVALID_PARAM p_config pointer is NULL.
  * @retval HAL_OK            Wakeup pin is configured correctly.
  * @note   (*) : Not available on all devices.
  */
hal_status_t HAL_PWR_LP_SetConfigWakeupPin(uint32_t wakeup_pin, const hal_pwr_wakeup_pin_config_t *p_config)
{
  uint32_t temp_pin = wakeup_pin;
  __IO uint32_t register_value = LL_PWR_READ_REG(WUCR);
  uint32_t position;
  uint32_t current_pin;

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_PWR_SET_WAKEUP_PIN(wakeup_pin));
  ASSERT_DBG_PARAM(IS_PWR_WAKEUP_PIN_POLARITY(p_config->polarity));
  ASSERT_DBG_PARAM(IS_PWR_WAKEUP_PIN_PULL(p_config->pull));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

