MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pwr.c
  /* Get wakeup pin information */
  position    = STM32_POSITION_VAL(temp_pin);
  current_pin = 1UL << position;

  while (temp_pin != 0U)
  {
    /* Mask values which will be modified */
    register_value &= ~(uint32_t)((LL_PWR_WAKEUP_PIN_REF << position) \
                                  + (LL_PWR_WAKEUP_PIN_PULL_REF << (position * LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET)));

    /* Compute new value */
    register_value |= (uint32_t)(((uint32_t)(p_config->polarity) << (LL_PWR_WAKEUP_PIN_REF_POS + position))
                                 + ((uint32_t)(p_config->pull) << (LL_PWR_WAKEUP_PIN_PULL_REF_POS \
                                                                   + (position \
                                                                      * LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET))));

    /* Update wakeup pin information */
    temp_pin    &= (~current_pin);
    position    = STM32_POSITION_VAL(temp_pin);
    current_pin = 1UL << position;
  }

  /* Set new value in one register access */
  LL_PWR_WRITE_REG(WUCR, register_value);

  return HAL_OK;
}

/**
  * @brief  Get wakeup pin configuration.
  * @param  wakeup_pin This parameter can be one of @ref PWR_wakeup_pin.
  *         @arg @ref HAL_PWR_WAKEUP_PIN_1
  *         @arg @ref HAL_PWR_WAKEUP_PIN_2
  *         @arg @ref HAL_PWR_WAKEUP_PIN_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_4
  *         @arg @ref HAL_PWR_WAKEUP_PIN_5
  *         @arg @ref HAL_PWR_WAKEUP_PIN_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_ALL
  * @param  p_config   Pointer to a @ref hal_pwr_wakeup_pin_config_t structure.
  * @note   (*) : Not available on all devices.
  */
void HAL_PWR_LP_GetConfigWakeupPin(uint32_t wakeup_pin, hal_pwr_wakeup_pin_config_t *p_config)
{
  uint32_t register_value = LL_PWR_READ_REG(WUCR);
  uint32_t temp = 0U;

  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_PWR_GET_WAKEUP_PIN(wakeup_pin));

  /* Get the configuration from register value */
  p_config->polarity = (hal_pwr_wakeup_pin_polarity_t)((register_value & (LL_PWR_WAKEUP_PIN_REF <<
                                                                          STM32_POSITION_VAL(wakeup_pin))) >>
                                                       (LL_PWR_WAKEUP_PIN_REF_POS + STM32_POSITION_VAL(wakeup_pin)));

  temp = (register_value & (LL_PWR_WAKEUP_PIN_PULL_REF << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                            (STM32_POSITION_VAL(wakeup_pin) & 0xFU)) & \
                                                           LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));

  p_config->pull     = (hal_pwr_wakeup_pin_pull_t)(temp >> ((LL_PWR_WAKEUP_PIN_PULL_REF_POS +
                                                             ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                               STM32_POSITION_VAL(wakeup_pin)) & 0xFU)) & \
                                                            LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK));
}

/**
  * @brief  Enable the wakeup pin configuration.
  * @param  wakeup_pin This parameter can be one or a combination of @ref PWR_wakeup_pin.
  *         @arg @ref HAL_PWR_WAKEUP_PIN_1
  *         @arg @ref HAL_PWR_WAKEUP_PIN_2
  *         @arg @ref HAL_PWR_WAKEUP_PIN_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_4
  *         @arg @ref HAL_PWR_WAKEUP_PIN_5
  *         @arg @ref HAL_PWR_WAKEUP_PIN_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_ALL
  * @note   (*) : Not available on all devices.
  * @note   Wakeup pins are used to wake up the system from Standby mode.
  */
void HAL_PWR_LP_EnableWakeupPin(uint32_t wakeup_pin)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_WAKEUP_PIN(wakeup_pin));

  LL_PWR_EnableWakeUpPin(wakeup_pin);
}

/**
  * @brief  Disable the wakeup pin configuration.
  * @param  wakeup_pin This parameter can be one or a combination of @ref PWR_wakeup_pin.
  *         @arg @ref HAL_PWR_WAKEUP_PIN_1
  *         @arg @ref HAL_PWR_WAKEUP_PIN_2
  *         @arg @ref HAL_PWR_WAKEUP_PIN_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_4
  *         @arg @ref HAL_PWR_WAKEUP_PIN_5
  *         @arg @ref HAL_PWR_WAKEUP_PIN_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_ALL
  * @note   (*) : Not available on all devices.
  * @note   Wakeup pins are used to wake up the system from Standby mode.
  */
void HAL_PWR_LP_DisableWakeupPin(uint32_t wakeup_pin)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_WAKEUP_PIN(wakeup_pin));

  LL_PWR_DisableWakeUpPin(wakeup_pin);
}

/**
  * @brief  Check whether the wakeup pin is enabled.
  * @param  wakeup_pin                  This parameter can be one of @ref PWR_wakeup_pin.
  *         @arg @ref HAL_PWR_WAKEUP_PIN_1
  *         @arg @ref HAL_PWR_WAKEUP_PIN_2
  *         @arg @ref HAL_PWR_WAKEUP_PIN_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_4
  *         @arg @ref HAL_PWR_WAKEUP_PIN_5
  *         @arg @ref HAL_PWR_WAKEUP_PIN_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_PIN_7 (*)
  * @retval Wakeup pin status
  *         @arg @ref HAL_PWR_WAKEUP_PIN_DISABLED Wakeup pin disabled
  *         @arg @ref HAL_PWR_WAKEUP_PIN_ENABLED  Wakeup pin enabled
  * @note   (*) : Not available on all devices.
  */
hal_pwr_wakeup_pin_status_t HAL_PWR_LP_IsEnabledWakeupPin(uint32_t wakeup_pin)
{
  ASSERT_DBG_PARAM(IS_PWR_GET_WAKEUP_PIN(wakeup_pin));

  return ((hal_pwr_wakeup_pin_status_t)LL_PWR_IsEnabledWakeUpPin(wakeup_pin));
}

/**
  * @brief  Return the wakeup sources.
  * @retval Can be one of or a combination of @ref PWR_wakeup_source.
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_1
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_2
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_4
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_5
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_ALL
  * @note   (*) : Not available on all devices.
  * @warning This API returns the wakeup source flags which can be a combination of multiple sources.
  */
uint32_t HAL_PWR_LP_GetWakeupSource(void)
{
  return (LL_PWR_READ_REG(WUSR));
}

/**
  * @brief  Clean the selected wakeup source(s) flag(s).
  * @param  wakeup_source  This parameter can be one or a combination of @ref PWR_wakeup_source.
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_1
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_2
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_3 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_4
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_5
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_6 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_7 (*)
  *         @arg @ref HAL_PWR_WAKEUP_SOURCE_ALL
  * @note   (*) : Not available on all devices.
  */
void HAL_PWR_LP_CleanWakeupSource(uint32_t wakeup_source)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_WAKEUP_SOURCE(wakeup_source));

  LL_PWR_ClearFlag_WU(wakeup_source);
}
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group2 RTC domain write protection management functions
  * @{
  This section provides functions to manage RTC domain write protection:
  - Call HAL_PWR_EnableRTCDomainWriteProtection() to enable RTC domain write protection.
  - Call HAL_PWR_DisableRTCDomainWriteProtection() to disable RTC domain write protection.
  - Call HAL_PWR_IsEnabledRTCDomainWriteProtection() to check whether RTC domain write protection is enabled.
  */

/**
  * @brief  Enable the RTC domain write protection (RCC RTC domain control register RCC_BDCR, RTC registers,
  *         TAMP registers, backup registers and backup SRAM).
  * @note   After a system reset, the RTC domain is protected against possible unwanted write accesses.
  */
void HAL_PWR_EnableRTCDomainWriteProtection(void)
{
  LL_PWR_EnableRTCDomainWriteProtection();
}

/**
  * @brief  Disable the RTC domain write protection (RCC RTC domain control register RCC_BDCR, RTC registers,
  *         TAMP registers, backup registers and backup SRAM).
  */
void HAL_PWR_DisableRTCDomainWriteProtection(void)
{
  LL_PWR_DisableRTCDomainWriteProtection();
}

/**
  * @brief  Check that RTC domain write protection is enabled.
  * @retval RTC Domain write protection status
  *         @arg @ref HAL_PWR_RTC_DOMAIN_WRP_DISABLED RTC domain write protection disabled.
  *         @arg @ref HAL_PWR_RTC_DOMAIN_WRP_ENABLED  RTC domain write protection enabled.
  */
hal_pwr_rtc_domain_wrp_status_t HAL_PWR_IsEnabledRTCDomainWriteProtection(void)
{
  return ((hal_pwr_rtc_domain_wrp_status_t)LL_PWR_IsEnabledRTCDomainWriteProtection());
}
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group3 Low power mode management functions
  * @{
  This section provides functions to manage low power modes:
  - Call HAL_PWR_ClearCorePendingEvent() to clear the internal Cortex event before entering low power mode using WFE.
  - Call HAL_PWR_EnterSleepMode() to enter the core into sleep mode.
  - Call HAL_PWR_EnterStopMode() to enter the MCU into stop x mode.
  - Call HAL_PWR_EnterStandbyMode() to enter the MCU into standby mode.
  - Call HAL_PWR_SetCoreSleepMode() to configure the core sleep or deep sleep mode.
  - Call HAL_PWR_GetCoreSleepMode() to get the core sleep mode configuration.
  - Call HAL_PWR_EnableCoreSleepOnExit() to enable the core to re-enter sleep mode after interrupt handling completes.
  - Call HAL_PWR_DisableCoreSleepOnExit() to disable the core from re-entering sleep mode after interrupt handling
    completes.
  - Call HAL_PWR_IsEnabledCoreSleepOnExit() to check whether core sleep-on-exit is enabled.
  - Call HAL_PWR_EnableCoreSendEventOnPending() to enable the core to wake up after any pending event/interrupt.
  - Call HAL_PWR_DisableCoreSendEventOnPending() to disable the core from waking up after any pending event/interrupt.
  - Call HAL_PWR_IsEnabledCoreSendEventOnPending() to check whether core send event on pending is enabled.
  - Call HAL_PWR_GetPreviousSystemPowerMode() to get previous system power mode.
  - Call HAL_PWR_CleanPreviousSystemPowerMode() to clean previous system power mode flag.
  */

/**
  * @brief   Clear core pending event.
  * @note    Clear the pending event to enter a given core into Sleep or stop mode with WFE entry.
  * @warning Call this function just before APIs that enter Sleep and stop mode using a Wait For Event request.
  */
void HAL_PWR_ClearCorePendingEvent(void)
{
  __SEV();
  __WFE();
}

/**
  * @brief  Enter the core into sleep mode.
  * @param  sleep_entry Parameter of the @ref hal_pwr_low_pwr_mode_entry_t enumeration.
  */
void HAL_PWR_EnterSleepMode(hal_pwr_low_pwr_mode_entry_t sleep_entry)
{
  ASSERT_DBG_PARAM(IS_PWR_LP_MODE_ENTRY((uint32_t)sleep_entry));

  /* Clear SLEEPDEEP bit of Cortex System Control Register */
  SCB_DisableDeepSleep();

  /* DSB to ensure there are no outstanding memory transactions prior to executing WFI/WFE and going to sleep. */
  __DSB();

  if (sleep_entry == HAL_PWR_LOW_PWR_MODE_WFE)
  {
    /* Wait For Event Request */
    __WFE();
  }
  else
  {
    /* Wait For Interrupt Request */
    __WFI();
  }
}

/**
  * @brief  Enter the MCU in stop mode.
  * @param  stop_entry This parameter is an element of @ref hal_pwr_low_pwr_mode_entry_t enumeration.
  * @param  stop_mode  This parameter is an element of @ref hal_pwr_stop_mode_t enumeration.
  */
void HAL_PWR_EnterStopMode(hal_pwr_low_pwr_mode_entry_t stop_entry, hal_pwr_stop_mode_t stop_mode)
{
  ASSERT_DBG_PARAM(IS_PWR_LP_MODE_ENTRY((uint32_t)stop_entry));
  ASSERT_DBG_PARAM(IS_PWR_STOP_MODE((uint32_t)stop_mode));

  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SCB_EnableDeepSleep();

