MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pwr.c
  LL_PWR_SetPowerMode((uint32_t)stop_mode);

  /* DSB to ensure there are no outstanding memory transactions prior to executing WFI/WFE and going to stop. */
  __DSB();

  if (stop_entry == HAL_PWR_LOW_PWR_MODE_WFE)
  {
    /* Wait For Event Request */
    __WFE();
  }
  else
  {
    /* Wait For Interrupt Request */
    __WFI();
  }

  /* Clear SLEEPDEEP bit of Cortex System Control Register */
  SCB_DisableDeepSleep();
}

/**
  * @brief  Enter the MCU in Standby mode.
  */
void HAL_PWR_EnterStandbyMode(void)
{
  /* Set SLEEPDEEP bit of Cortex System Control Register */
  SCB_EnableDeepSleep();

  LL_PWR_SetPowerMode(LL_PWR_STANDBY_MODE);

  /* DSB to ensure there are no outstanding memory transactions prior to executing WFI and going to standby. */
  __DSB();

  /* Wait For Interrupt Request */
  __WFI();
}

/**
  * @brief  Set the core sleep mode configuration.
  * @param  sleep_mode This parameter is an element of @ref hal_pwr_core_sleep_mode_t enumeration.
  */
void HAL_PWR_SetCoreSleepMode(hal_pwr_core_sleep_mode_t sleep_mode)
{
  ASSERT_DBG_PARAM(IS_PWR_CORE_SLEEP_MODE((uint32_t)sleep_mode));

  if (sleep_mode == HAL_PWR_CORE_DEEP_SLEEP)
  {
    SCB_EnableDeepSleep();
  }
  else
  {
    SCB_DisableDeepSleep();
  }
}

/**
  * @brief  Get the core sleep mode configuration.
  * @retval HAL_PWR_CORE_SLEEP      Core sleep mode.
  * @retval HAL_PWR_CORE_DEEP_SLEEP Core deep sleep mode.
  */
hal_pwr_core_sleep_mode_t HAL_PWR_GetCoreSleepMode(void)
{
  return ((hal_pwr_core_sleep_mode_t)(SCB_IsEnabledDeepSleep()));
}

/**
  * @brief  Enable SLEEP-ON-EXIT feature when returning from handler mode to thread mode.
  */
void HAL_PWR_EnableCoreSleepOnExit(void)
{
  SCB_EnableSleepOnExit();
}

/**
  * @brief  Disable SLEEP-ON-EXIT feature when returning from handler mode to thread mode.
  */
void HAL_PWR_DisableCoreSleepOnExit(void)
{
  SCB_DisableSleepOnExit();
}

/**
  * @brief  Check whether core SLEEP-ON-EXIT is enabled.
  * @retval hal_pwr_core_sleep_on_exit_status_t Core sleep-on-exit status.
  */
hal_pwr_core_sleep_on_exit_status_t HAL_PWR_IsEnabledCoreSleepOnExit(void)
{
  return ((hal_pwr_core_sleep_on_exit_status_t)(SCB_IsEnabledSleepOnExit()));
}

/**
  * @brief  Enable core Send Event On Pending feature.
  */
void HAL_PWR_EnableCoreSendEventOnPending(void)
{
  SCB_EnableEventOnPend();
}

/**
  * @brief  Disable core Send Event On Pending.
  */
void HAL_PWR_DisableCoreSendEventOnPending(void)
{
  SCB_DisableEventOnPend();
}

/**
  * @brief  Get core Send Event On Pending status.
  * @retval HAL_PWR_CORE_SEV_ON_PENDING_DISABLED Core send event on pending disabled.
  * @retval HAL_PWR_CORE_SEV_ON_PENDING_ENABLED  Core send event on pending enabled.
  */
hal_pwr_core_sev_on_pending_status_t HAL_PWR_IsEnabledCoreSendEventOnPending(void)
{
  return ((hal_pwr_core_sev_on_pending_status_t)(SCB_IsEnabledEventOnPend()));
}

/**
  * @brief  Get the previous system power mode.
  * @retval hal_pwr_system_mode_t Previous power mode.
  * @note   Sleep mode is an ARM core mode and not a system power mode as it does not affect system clock on return
  *          from sleep, so it is not reported by this function.
  * @warning This function is expected to be called on return from low power mode so to take the necessary actions
  *           such as re-enabling clocks automatically disabled during low power mode.
  */
hal_pwr_system_mode_t HAL_PWR_GetPreviousSystemPowerMode(void)
{
  hal_pwr_system_mode_t previous_mode = HAL_PWR_SYSTEM_RUN_MODE;

  /* Check Standby flag */
  if (LL_PWR_IsActiveFlag_SB() != 0U)
  {
    previous_mode = HAL_PWR_SYSTEM_STANDBY_MODE;
  }
  else
  {
    /* Check Stop flag */
    if (LL_PWR_IsActiveFlag_STOP() != 0U)
    {
      /* Check which Stop Mode has been configured */
      if (LL_PWR_GetPowerMode() == LL_PWR_STOP0_MODE)
      {
        previous_mode = HAL_PWR_SYSTEM_STOP0_MODE;
      }
      else
      {
        previous_mode = HAL_PWR_SYSTEM_STOP1_MODE;
      }
    }
  }

  return previous_mode;
}

/**
  * @brief   Clean the previous system power mode flags.
  * @note    This function must be called before entering in low power mode to ensure that
  *           HAL_PWR_GetPreviousSystemPowerMode() will return the right information on return from low power mode.
  * @warning This function clears both standby and stop flags.
  */
void HAL_PWR_CleanPreviousSystemPowerMode(void)
{
  LL_PWR_ClearFlag_SB();
}
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group4 Voltage monitoring management functions
  * @{
  This section provides functions to manage voltage monitoring.
  - Call HAL_PWR_EnableProgrammableVoltageDetector() to enable the programmable voltage detector.
  - Call HAL_PWR_DisableProgrammableVoltageDetector() to disable the programmable voltage detector.
  - Call HAL_PWR_IsEnabledProgrammableVoltageDetector() to check whether the programmable voltage detector is
    enabled.
  - Call HAL_PWR_GetProgrammableVoltageDetectorOutput() to get the programmable voltage detector output value.
  */

/**
  * @brief  Enable the voltage threshold detection by the programmable voltage detector (PVD).
  */
void HAL_PWR_EnableProgrammableVoltageDetector(void)
{
  LL_PWR_EnablePVD();
}

/**
  * @brief  Disable the voltage threshold detection by the programmable voltage detector (PVD).
  */
void HAL_PWR_DisableProgrammableVoltageDetector(void)
{
  LL_PWR_DisablePVD();
}

/**
  * @brief  Check whether the programmable voltage detection is enabled.
  * @retval HAL_PWR_PVD_DISABLED Programmable voltage detection disabled.
  * @retval HAL_PWR_PVD_ENABLED  Programmable voltage detection enabled.
  */
hal_pwr_pvd_status_t HAL_PWR_IsEnabledProgrammableVoltageDetector(void)
{
  return ((hal_pwr_pvd_status_t)LL_PWR_IsEnabledPVD());
}

/**
  * @brief  Provide the current PVD output.
  * @retval HAL_PWR_PVD_OUT_EQ_HIGH_THR VDD is equal or higher than programmable voltage detector threshold.
  * @retval HAL_PWR_PVD_OUT_LOW_THR  VDD is lower than programmable voltage detector threshold.
  */
hal_pwr_pvd_out_t HAL_PWR_GetProgrammableVoltageDetectorOutput(void)
{
  return (hal_pwr_pvd_out_t)LL_PWR_IsActiveFlag_PVDO();
}

/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group5 Memory retention management functions
  * @{
 This section provides functions to manage memory content retention.
 - Call HAL_PWR_LP_EnableMemoryRetention() to enable memory retention.
 - Call HAL_PWR_LP_DisableMemoryRetention() to disable memory retention.
 - Call HAL_PWR_LP_IsEnabledMemoryRetention() to check whether selected memory retention is enabled.
 - Call HAL_PWR_LP_EnableMemoryPageRetention() to enable memory retention for selected pages. (*)
 - Call HAL_PWR_LP_DisableMemoryPageRetention() to disable memory retention for selected pages. (*)
 - Call HAL_PWR_LP_IsEnabledMemoryPageRetention() to check whether selected memory page retention is enabled. (*)
  * @note   (*) : Not available on all devices.
 */

/**
  * @brief  Enable memory retention in stop mode.
  * @param  memory This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @retval HAL_OK Memory retention has been correctly enabled.
  * @retval HAL_INVALID_PARAM The selected memory does not exist while USE_HAL_CHECK_PARAM is used.
  * @retval HAL_ERROR Selected memory is paginated, use HAL_PWR_LP_EnableMemoryPageRetention().
  */
hal_status_t HAL_PWR_LP_EnableMemoryRetention(hal_pwr_memory_retention_t memory)
{
  ASSERT_DBG_PARAM(IS_PWR_SINGLE_PAGE_MEMORY_RETENTION((uint32_t)memory));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check if the selected memory exists */
  if ((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
  {
    /* Selected memory does not exist */
    return HAL_INVALID_PARAM;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    /* Check if the selected memory is paginated or not */
    if (PWR_MemoryMaxPagesRetentionMap[memory] == 1U)
    {
      /* Enable Memory Retention */
      LL_PWR_EnableMemoryStopRetention(PWR_MemoryFullRetentionMap[memory]);
      return HAL_OK;
    }
    else
    {
      /* Paginated SRAM are managed by HAL_PWR_LP_EnableMemoryPageRetention() */
      return HAL_ERROR;
    }
  }
}

/**
  * @brief  Disable memory retention in stop mode.
  * @param  memory  This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @retval HAL_OK  Memory retention has been correctly disabled.
  * @retval HAL_INVALID_PARAM The selected memory does not exist while USE_HAL_CHECK_PARAM is used.
  * @retval HAL_ERROR Selected memory is paginated, use HAL_PWR_LP_DisableMemoryPageRetention().
  */
hal_status_t HAL_PWR_LP_DisableMemoryRetention(hal_pwr_memory_retention_t memory)
{
  ASSERT_DBG_PARAM(IS_PWR_SINGLE_PAGE_MEMORY_RETENTION((uint32_t)memory));

#if defined(USE_HAL_CHECK_PARAM)
  /* Check if the selected memory exists */
  if ((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
  {
    /* Selected memory does not exist */
    return HAL_INVALID_PARAM;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    /* Check if the selected memory is paginated or not */
    if (PWR_MemoryMaxPagesRetentionMap[memory] == 1U)
    {
      /* Disable Memory Retention */
      LL_PWR_DisableMemoryStopRetention(PWR_MemoryFullRetentionMap[memory]);
      return HAL_OK;
    }
    else
    {
      /* Paginated SRAM are managed by HAL_PWR_LP_DisableMemoryPageRetention() */
      return HAL_ERROR;
    }
  }
}

/**
  * @brief  Get memory retention status.
  * @param  memory  This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @retval HAL_PWR_MEMORY_RETENTION_DISABLED if the selected memory is not retained in stop mode or
  *         if the selected memory does not exist while USE_HAL_CHECK_PARAM is used.
  * @retval HAL_PWR_MEMORY_RETENTION_ENABLED  if the selected memory is retained in stop mode.
  * @note   If the ASSERT are disabled, HAL_PWR_MEMORY_RETENTION_DISABLED is returned for paginated memories.
  */
hal_pwr_memory_retention_status_t HAL_PWR_LP_IsEnabledMemoryRetention(hal_pwr_memory_retention_t memory)
{
  ASSERT_DBG_PARAM(IS_PWR_SINGLE_PAGE_MEMORY_RETENTION((uint32_t)memory));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check if the selected memory exists */
  if ((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
  {
    /* Selected memory does not exist */
    return HAL_PWR_MEMORY_RETENTION_DISABLED;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    if (PWR_MemoryMaxPagesRetentionMap[memory] == 1U)
    {
      /* Return the selected memory retention status */
      return ((hal_pwr_memory_retention_status_t)
              LL_PWR_IsEnabledMemoryStopRetention(PWR_MemoryFullRetentionMap[memory]));
    }
    else
    {
      /* Paginated SRAM are managed by HAL_PWR_LP_IsEnabledMemoryPageRetention() */
      return HAL_PWR_MEMORY_RETENTION_DISABLED;
    }
  }
}

#if defined(PWR_PMCR_SRAM2_1_SO)
/**
  * @brief  Enable memory page retention in stop mode.
  * @param  memory    This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @param  page_idx  the index of memory page (starting from 1).
  * @param  page_nbr  The memory pages number.
  * @retval HAL_OK    Memory page retention has been correctly enabled.
  * @retval HAL_INVALID_PARAM The selected memory does not exist, the page index is out of range or the selected number
  *         of pages does not fit the memory.
  * @retval HAL_ERROR Memory page retention could not be enabled, the selected memory is not paginated.
  */
hal_status_t HAL_PWR_LP_EnableMemoryPageRetention(hal_pwr_memory_retention_t memory,
                                                  uint32_t page_idx,
                                                  uint32_t page_nbr)
{
  uint32_t pages = 0;
  uint32_t logical_idx = 0;
  hal_status_t status = HAL_OK;

