MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pwr.c
  ASSERT_DBG_PARAM(IS_PWR_MEMORY_PAGES_RETENTION((uint32_t)memory, page_idx, page_nbr));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check if the selected memory exists, the page index is valid and if the selected number of pages fits the memory */
  if (((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
      || (page_idx > PWR_MemoryMaxPagesRetentionMap[memory])
      || (((page_idx - 1U) + page_nbr) > PWR_MemoryMaxPagesRetentionMap[memory]))
  {
    status = HAL_INVALID_PARAM;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    if (PWR_MemoryMaxPagesRetentionMap[memory] != 1U)
    {
      for (uint32_t i = 0; i < page_nbr; ++i)
      {
        logical_idx = page_idx + i;
        switch (logical_idx)
        {
          /* SRAM2 Page 1 */
          case 1:
          {
            pages |= LL_PWR_SRAM2_PAGE1_STOP_RETENTION;
            break;
          }

          /* SRAM2 Page 2 */
          case 2:
          {
            pages |= LL_PWR_SRAM2_PAGE2_STOP_RETENTION;
            break;
          }

#if defined(PWR_PMCR_SRAM2_3_SO)
          /* SRAM2 Page 3 */
          case 3:
          {
            pages |= LL_PWR_SRAM2_PAGE3_STOP_RETENTION;
            break;
          }
#endif /* PWR_PMCR_SRAM2_3_SO */

          default:
          {
            /* Out-of-range cases */
            status = HAL_ERROR;
            break;
          }
        }
      }

      /* If no error occurred, enable the pages stop retention */
      if (status == HAL_OK)
      {
        /* Pages stop retention enabling */
        LL_PWR_EnableSRAM2PagesStopRetention(pages);
      }
    }
    else
    {
      /* Non paginated SRAM are managed by HAL_PWR_LP_EnableMemoryRetention() */
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Disable memory page retention in stop mode.
  * @param  memory    This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @param  page_idx  the index of memory page (starting from 1).
  * @param  page_nbr  The memory pages number.
  * @retval HAL_OK    Memory page retention has been correctly disabled.
  * @retval HAL_INVALID_PARAM The selected memory does not exist, the page index is out of range or the selected number
  *         of pages does not fit the memory.
  * @retval HAL_ERROR Memory page retention could not be disabled, the selected memory is not paginated.
  */
hal_status_t HAL_PWR_LP_DisableMemoryPageRetention(hal_pwr_memory_retention_t memory,
                                                   uint32_t page_idx,
                                                   uint32_t page_nbr)
{
  uint32_t pages = 0;
  uint32_t logical_idx = 0;
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM(IS_PWR_MEMORY_PAGES_RETENTION((uint32_t)memory, page_idx, page_nbr));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check if the selected memory exists, the page index is valid and if the selected number of pages fits the memory */
  if (((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
      || (page_idx > PWR_MemoryMaxPagesRetentionMap[memory])
      || (((page_idx - 1U) + page_nbr) > PWR_MemoryMaxPagesRetentionMap[memory]))
  {
    status = HAL_INVALID_PARAM;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    if (PWR_MemoryMaxPagesRetentionMap[memory] != 1U)
    {
      for (uint32_t i = 0; i < page_nbr; ++i)
      {
        logical_idx = page_idx + i;
        switch (logical_idx)
        {
          /* SRAM2 Page 1 */
          case 1:
          {
            pages |= LL_PWR_SRAM2_PAGE1_STOP_RETENTION;
            break;
          }

          /* SRAM2 Page 2 */
          case 2:
          {
            pages |= LL_PWR_SRAM2_PAGE2_STOP_RETENTION;
            break;
          }

#if defined(PWR_PMCR_SRAM2_3_SO)
          /* SRAM2 Page 3 */
          case 3:
          {
            pages |= LL_PWR_SRAM2_PAGE3_STOP_RETENTION;
            break;
          }
#endif /* PWR_PMCR_SRAM2_3_SO */

          default:
          {
            /* Out-of-range cases */
            status = HAL_ERROR;
            break;
          }
        }
      }

      /* If no error occurred, disable the pages stop retention */
      if (status == HAL_OK)
      {
        /* Pages stop retention disabling */
        LL_PWR_DisableSRAM2PagesStopRetention(pages);
      }
    }
    else
    {
      /* Non paginated SRAM are managed by HAL_PWR_LP_DisableMemoryRetention() */
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  Check the selected memory page retention in stop mode status.
  * @param  memory    This parameter is an element of @ref hal_pwr_memory_retention_t enumeration.
  * @param  page_idx  the index of memory page (starting from 1).
  * @retval HAL_PWR_MEMORY_PAGE_RETENTION_DISABLED if the selected memory page is not retained in stop mode or
  *         if the selected memory does not exist while USE_HAL_CHECK_PARAM is used.
  * @retval HAL_PWR_MEMORY_PAGE_RETENTION_ENABLED  if the selected memory page is retained in stop mode.
  * @note   If the ASSERT are disabled, HAL_PWR_MEMORY_PAGE_RETENTION_DISABLED is returned for out-of-range pages or
  *         non-paginated memories.
  */
hal_pwr_memory_page_retention_status_t HAL_PWR_LP_IsEnabledMemoryPageRetention(hal_pwr_memory_retention_t memory,
                                                                               uint32_t page_idx)
{
  hal_pwr_memory_page_retention_status_t status = HAL_PWR_MEMORY_PAGE_RETENTION_DISABLED;
  uint32_t page = 0;

  ASSERT_DBG_PARAM(IS_PWR_MEMORY_PAGES_RETENTION((uint32_t)memory, page_idx, 1U));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check if the selected memory exists, the page index is valid and if the selected number of pages fits the memory */
  if (((uint32_t)memory >= PWR_MEMORY_BANKS_NUMBER)
      || (page_idx > PWR_MemoryMaxPagesRetentionMap[memory]))
  {
    /* Selected SRAM bank is not valid */
    status = HAL_PWR_MEMORY_PAGE_RETENTION_DISABLED;
  }
  else
#endif /* USE_HAL_CHECK_PARAM */
  {
    if (PWR_MemoryMaxPagesRetentionMap[memory] != 1U)
    {
      switch (page_idx)
      {
        /* SRAM2 Page 1 */
        case 1:
        {
          page = LL_PWR_SRAM2_PAGE1_STOP_RETENTION;
          break;
        }

        /* SRAM2 Page 2 */
        case 2:
        {
          page = LL_PWR_SRAM2_PAGE2_STOP_RETENTION;
          break;
        }

#if defined(PWR_PMCR_SRAM2_3_SO)
        /* SRAM2 Page 3 */
        case 3:
        {
          page = LL_PWR_SRAM2_PAGE3_STOP_RETENTION;
          break;
        }
#endif /* PWR_PMCR_SRAM2_3_SO */

        default:
        {
          /* Ignore out-of-range cases */
          break;
        }
      }

      /* Get memory page retention status */
      if ((LL_PWR_IsEnabledSRAM2PagesStopRetention(page) != 0UL) && (page != 0UL))
      {
        status = HAL_PWR_MEMORY_PAGE_RETENTION_ENABLED;
      }
    }
  }

