MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pwr.c
  return status;
}
#endif /* PWR_PMCR_SRAM2_1_SO */
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group6 Memory management functions
  * @{
 This section provides functions to manage flash memory low power modes.
 - Call HAL_PWR_LP_EnableFlashLowPWRMode() to enable flash memory power down in stop 0/1 mode.
 - Call HAL_PWR_LP_DisableFlashLowPWRMode() to disable flash memory power down in stop 0/1 mode.
 - Call HAL_PWR_LP_IsEnabledFlashLowPWRMode() to check the flash memory power down status in stop 0/1 mode.
  */
/**
  * @brief  Enable the flash low power mode.
  */
void HAL_PWR_LP_EnableFlashLowPWRMode(void)
{
  LL_PWR_EnableFlashLowPWRMode();
}

/**
  * @brief  Disable the flash low power mode.
  */
void HAL_PWR_LP_DisableFlashLowPWRMode(void)
{
  LL_PWR_DisableFlashLowPWRMode();
}

/**
  * @brief  Check whether the flash low power mode is enabled.
  * @retval hal_pwr_Flash_low_pwr_mode_status_t Flash low power mode status.
  */
hal_pwr_flash_low_pwr_mode_status_t HAL_PWR_LP_IsEnabledFlashLowPWRMode(void)
{
  return (hal_pwr_flash_low_pwr_mode_status_t)LL_PWR_IsEnabledFlashLowPWRMode();
}
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group7 I/O retention management functions
  * @{
  This section provides functions to manage I/O retention in low power mode.
  - Call HAL_PWR_LP_EnableIORetention() to enable I/O (GPIO and/or JTAGIO) retention in Standby mode.
  - Call HAL_PWR_LP_DisableIORetention() to disable I/O (GPIO and/or JTAGIO) retention in Standby mode.
  - Call HAL_PWR_LP_IsEnabledIORetention() to check whether I/O (GPIO or JTAGIO) retention in Standby mode is enabled.
  */

/**
  * @brief  Enable the IO retention in Standby mode.
  * @param  io This parameter is an element or combination of elements of @ref hal_pwr_io_retention_t enumeration.
  *            @arg @ref HAL_PWR_IO_RETENTION_JTAGIO IO retention mode is enabled for JTAG I/Os (PA13, PA14, PA15, and
  *                       PB4).
  *            @arg @ref HAL_PWR_IO_RETENTION_GPIO   IO retention mode is enabled for all I/Os except the I/Os
  *                       supporting the Standby functionality and JTAG I/Os.
  *            @arg @ref HAL_PWR_IO_RETENTION_ALL    IO retention mode is enabled for all I/Os.
  * @note   The output is sampled and applied to the output I/O during Standby mode.
  */
void HAL_PWR_LP_EnableIORetention(hal_pwr_io_retention_t io)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_IO_RETENTION(((uint32_t)io)));

  LL_PWR_WRITE_REG(IORETR, (LL_PWR_READ_REG(IORETR) | (uint32_t)io));
}

/**
  * @brief  Disable the IO retention in Standby mode.
  * @param  io This parameter is an element of @ref hal_pwr_io_retention_t enumeration.
  *            @arg @ref HAL_PWR_IO_RETENTION_JTAGIO IO retention mode is disabled for JTAG I/Os (PA13, PA14, PA15, and
  *                       PB4).
  *            @arg @ref HAL_PWR_IO_RETENTION_GPIO   IO retention mode is disabled for all I/Os except the I/Os
  *                       supporting the Standby functionality and JTAG I/Os.
  *            @arg @ref HAL_PWR_IO_RETENTION_ALL    IO retention mode is disabled for all I/Os.
  */
void HAL_PWR_LP_DisableIORetention(hal_pwr_io_retention_t io)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_IO_RETENTION(((uint32_t)io)));

  LL_PWR_WRITE_REG(IORETR, (LL_PWR_READ_REG(IORETR) & ~(uint32_t)io));
}

/**
  * @brief  Check whether I/O retention in Standby mode is enabled.
  * @param  io This parameter is an element of @ref hal_pwr_io_retention_t enumeration.
  *            @arg @ref HAL_PWR_IO_RETENTION_JTAGIO IO retention mode is enabled for JTAG I/Os (PA13, PA14, PA15, and
  *                                                  PB4).
  *            @arg @ref HAL_PWR_IO_RETENTION_GPIO   IO retention mode is enabled for all I/Os except the I/Os
  *                                                  supporting the Standby functionality and JTAG I/Os.
  * @retval hal_pwr_io_retention_status_t The I/O retention status.
  */
hal_pwr_io_retention_status_t HAL_PWR_LP_IsEnabledIORetention(hal_pwr_io_retention_t io)
{
  hal_pwr_io_retention_status_t status = HAL_PWR_IO_RETENTION_DISABLED;

  ASSERT_DBG_PARAM(IS_PWR_GET_IO_RETENTION((uint32_t)io));

  if (io == HAL_PWR_IO_RETENTION_JTAGIO)
  {
    status = (hal_pwr_io_retention_status_t)LL_PWR_IsEnabledJTAGIORetentionStandbyMode();
  }

  if (io == HAL_PWR_IO_RETENTION_GPIO)
  {
    status = (hal_pwr_io_retention_status_t)LL_PWR_IsEnabledIORetentionStandbyMode();
  }

  return status;
}
/**
  * @}
  */

/** @addtogroup PWR_Exported_Functions_Group8 Privilege management functions
  * @{
  This section provides functions to manage privilege attributes.
  - Call HAL_PWR_SetPrivAttr() to set the privilege attribute.
  - Call HAL_PWR_GetPrivAttr() to get the privilege attribute.
  */
/**
  * @brief  Set privilege attribute.
  * @param  item The item attribute to be configured.
  * @param  priv_attr This parameter is an element of @ref hal_pwr_priv_attr_t enumeration:
  *         @arg @ref HAL_PWR_PRIV   Privileged attribute.
  *         @arg @ref HAL_PWR_NPRIV  Unprivileged attribute.
  * @retval HAL_ERROR  The function is called in unprivileged mode.
  * @retval HAL_OK     Privilege attribute has been correctly set.
  */
hal_status_t HAL_PWR_SetPrivAttr(uint32_t item, hal_pwr_priv_attr_t priv_attr)
{
  ASSERT_DBG_PARAM(IS_PWR_SET_PRIV_ITEM(item));

  if (STM32_IS_PRIVILEGED_EXECUTION() == 0U)
  {
    return HAL_ERROR;
  }

  LL_PWR_SetPrivAttr(item, (uint32_t)priv_attr);

  return HAL_OK;
}

/**
  * @brief  Get privilege attribute.
  * @param  item The item attribute to be queried.
  * @retval hal_pwr_priv_attr_t This parameter is an element of @ref hal_pwr_priv_attr_t enumeration.
  */
hal_pwr_priv_attr_t HAL_PWR_GetPrivAttr(uint32_t item)
{
  ASSERT_DBG_PARAM(IS_PWR_GET_PRIV_ITEM(item));

  return ((hal_pwr_priv_attr_t)LL_PWR_GetPrivAttr(item));
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_PWR_MODULE */
#endif /* PWR */
/**
  * @}
  */

/**
  * @}
  */
